---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.ToggleButtonData
source: html/c483d306-8fec-a0d2-3d3c-d1b8082d6fb2.htm
---
# ToggleButtonData Members

Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.